In [2]:
import sqlite3
import pandas as pd

In [3]:
#intialize the database from a script
DB_FILE = 'student_db'
initscript = 'initdb.sql'
with sqlite3.connect(DB_FILE) as con:
    with open(initscript,'r') as f:
        sql_commands = f.read()
        con.executescript(sql_commands)

In [4]:
# drop table 
con.execute('DROP TABLE IF EXISTS student')

In [5]:
con.execute('SELECT * FROM student')

OperationalError: no such table: student

In [6]:
# create the table again
con.execute('''CREATE TABLE IF NOT EXISTS student( 
first_name TEXT NOT NULL,
last_name TEXT NOT NULL, 
age INT NOT NULL,
id INT PRIMARY KEY
);
''')
con.commit() #confirm that the command has ran

In [7]:
# insert values
to_insert = [("Andrew","Rukangu",50,5),
                 ("Marie","Curie",100,6),
                 ("Spongebob", "Squarepants",50,7),
                 ("Tom", "Jerry",60,8)
                 ]
con.executemany("INSERT INTO student VALUES (?,?,?,?)", to_insert)

In [8]:
con.execute('SELECT * FROM student').fetchall()

[('Andrew', 'Rukangu', 50, 5),
 ('Marie', 'Curie', 100, 6),
 ('Spongebob', 'Squarepants', 50, 7),
 ('Tom', 'Jerry', 60, 8)]

In [9]:
#insert one record
con.execute("INSERT INTO student VALUES(?,?,?,?)", ('Albert', 'Einstein',100,9))

In [11]:
con.execute('SELECT * FROM student').fetchall()

[('Andrew', 'Rukangu', 50, 5),
 ('Marie', 'Curie', 100, 6),
 ('Spongebob', 'Squarepants', 50, 7),
 ('Tom', 'Jerry', 60, 8),
 ('Albert', 'Einstein', 100, 9)]

In [12]:
# select based on condition: age > 50
con.execute('SELECT * FROM student WHERE age>50').fetchall()

[('Marie', 'Curie', 100, 6),
 ('Tom', 'Jerry', 60, 8),
 ('Albert', 'Einstein', 100, 9)]

In [14]:
# read data into pandas df
df=pd.read_sql('SELECT * FROM student', con)
df.head()

  first_name    last_name  age  id
0     Andrew      Rukangu   50   5
1      Marie        Curie  100   6
2  Spongebob  Squarepants   50   7
3        Tom        Jerry   60   8
4     Albert     Einstein  100   9

In [15]:
# rename table
command = '''ALTER TABLE student RENAME TO students;'''
con.execute(command)

In [16]:
# select specific columns 
command = '''SELECT first_name, last_name FROM students'''
con.execute(command).fetchall()

[('Andrew', 'Rukangu'),
 ('Marie', 'Curie'),
 ('Spongebob', 'Squarepants'),
 ('Tom', 'Jerry'),
 ('Albert', 'Einstein')]

In [17]:
# search using LIKE

command = '''SELECT * FROM students WHERE first_name LIKE "a%"'''
con.execute(command).fetchall()

[('Andrew', 'Rukangu', 50, 5), ('Albert', 'Einstein', 100, 9)]

- %	Represents zero or more characters
- _	Represents a single character
- []	Represents any single character within the brackets *
- ^	Represents any character not in the brackets *
- \-	Represents any single character within the specified range *
- {}	Represents any escaped character **

In [18]:
# insert one record using dict method
command = """INSERT INTO students (first_name, last_name,age,id) VALUES(:fname,:lname,:age,:id)"""
params = {'fname':'Von', 'lname':'Neumann','age':60,'id':12}
con.execute('SELECT * FROM students').fetchall()

[('Andrew', 'Rukangu', 50, 5),
 ('Marie', 'Curie', 100, 6),
 ('Spongebob', 'Squarepants', 50, 7),
 ('Tom', 'Jerry', 60, 8),
 ('Albert', 'Einstein', 100, 9)]